import '../CSS/Selfintro.css';

const SelfIntro = () => {
  return (
    <div id ="selfIntro">
      <div class ="division">
        <h3>자기소개</h3>
        <p>
        안녕하세요! 저는 코딩 교육자로서의 열정과 경험을 가진 양서연입니다.

컴퓨터와 프로그래밍에 대한 관심은 학창 시절부터 시작되었습니다. 코딩은 놀라운 창의성을 발휘하고 문제 해결 능력을 키우는 도구라고 믿습니다. 이러한 믿음으로부터 교육 분야로 진로를 선택하게 되었고, 학생들에게 코딩을 가르치며 그들의 무한한 잠재력을 발견하는 즐거움을 경험했습니다.

지난 6개월 동안 학교 코딩 교육센터에서 교육자로 일했습니다. 학생들에게 코딩의 기초부터 고급 주제까지 학습을 제공하면서, 개별 학생들의 학습 스타일과 수준에 맞춤화된 교육 방법을 개발했습니다. 또한, 팀 프로젝트를 통해 협업과 소통 능력을 향상시키는데 주력했습니다.

나의 교육 방식은 실습 중심과 문제 해결 중심입니다. 학생들이 직접 코딩을 해보고 프로젝트를 통해 실제로 활용하는 경험을 통해 개념을 이해하도록 돕습니다. 또한, 코딩이 어려운 개념이 아닌 창의성을 발휘하고 문제를 해결하는 재미있는 도구로 인식될 수 있도록 노력합니다.

저의 목표는 학생들이 코딩을 습득하면서 동시에 자신의 능력과 열정을 발견하고 성장할 수 있도록 도와주는 것입니다. 끊임없는 학습과 함께 선생님과 학생이 함께 성장하는 환경을 만들어내기 위해 노력하고 있습니다.

감사합니다.
        </p>
      </div>
      
      


    </div>
  );
};

export default SelfIntro;
