import '../CSS/Experience.css';
const Experience = () => {
  return (
    <div>
      <h1>기타 스킬과 경험들</h1>
      <img src="/image/contest1.png" alt="react" />
      <fieldset>
        <legend>공모전 개요</legend>
        <h3>교육 경력 : </h3>
        <ul>
          <li>초등학교 5학년부터 고등학교 1학년까지 다양한 연령대와 배경의 학생들에게 기술을 가르친 경험이 있습니다.   </li>
          <li>대학에서 컴퓨터공학을 전공하며 배운 지식을 바탕으로 개발자가 꿈이거나 개발에 관심이 있는 학생들에게 코딩 교육을 진행했습니다.</li>
        </ul>
        <h3>프로그램 예시</h3>
        <ul>
          <li>아두이노 - 아두이노 키트 활용해서 전구, 신호등, 부저 등 부속품을 용도에 맞춰 코딩하기</li>
          <li>파이썬 - tkinter 모듈 이용해 메뉴와 키오스크 만들기</li>
          <li>엔트리 - 햄스터봇 연결해서 엔트리로 블럭 코딩, 미로찾기와 그림 그리기</li>
        </ul>
        <li>위 프로그램을 통해 학생들의 개발에 대한 호기심을 기르고 문제해결능력을 향상시켰습니다.</li>
        <li>프로그래밍, 전자공학, 및 로봇 공학 분야에서 여러분야의 경험을 통해 아두이노와 파이썬을 활용하여 다양한 프로젝트를 개발하고, 이러한 경험을 학생들과 공유함으로써 기술적 지식을 전파하고자 합니다.</li>
      </fieldset>
    </div>
  );
};

export default Experience;
